using System.Collections;
using System.Collections.Generic;
using UnityEngine;
/*
==============================
 * 최종수정일 : 2022-06-05
 * 작성자 : Inklie
 * 파일명 : KnightName.cs
==============================
*/
public class KnightName : MonoBehaviour
{
    List<string> prefix = new List<string>()
    {"가냘픈", "가는", "가엾은", "가파른","같은","거센","거친","검은","게으른","게을러빠진","게을러터진",
        "고달픈","고른","고마운","고운","고픈","곧은","괜찮은","구석진","굳은","굵은","귀여운","그런","그른",
        "그리운","기다란","기쁜","긴","깊은","깎아지른","깨끗한",
        "나쁜","나은","난데없는","날랜","날카로운","낮은","너그러운","너른","널따란","넓은","네모난","노란",
        "높은","누런","눅은","느닷없는","느린","늦은",
        "다른","더러운","더운","덜된","동그란","돼먹잖은","된","둥그런","둥근","뒤늦은","드문","딱한","때늦은"};

    public List<string> Prefix
    {
        get { return prefix; }
    }
    List<string> suffix = new List<string>()
    {
        "가람", "가온", "가을", "겨운","겨울","구슬","기쁨","나라","나래","나리","나루",
        "나림","나은","노을","누리","다래","다솔","다솜","다온","다희","단비","두리","둘리","라온",
        "로운","루다","루마","마루","마음","미리내","미르",
        "믿음","바다","바람","바우","밤비","별","별비","보라","보람","보미","빛나","산들",
        "사랑","새벽","샛별","소라","소리","슬기",
        "슬비","슬아","아담","아람","아리","여름","우리","이슬","제니","초롱","푸름","한결","한울",
        "이노센스", "사이온", "크리스", "레오","나르도","다비","디카","프리","오리","해리","포터",
        "톰","홀랜드","소니","태빵","이누","야샤","가영","안수","파티","케인","델리","알리","에릭센",
        "치히로","우에노","주리","잉크","라이","미소","세상","다이어","은돔","벨레","엠마","왓슨","소나",
        "짱구","우즈","마키","이치"
    };

    public List<string> Suffix
    {
        get { return suffix; }
    }

    public string GetRandomPrefix()
    {
        return prefix[Random.Range(0, prefix.Count)];
    }

    public string GetRandomSuffix()
    {
        return suffix[Random.Range(0, suffix.Count)];
    }
}
